package _06_;

public class _6_Class {
    public static void main(String[] args) {
    }
    /*클래스 정의
    1. 설계도
    2. 데이터와 함수의 결합
    변수 > 배열 > 구조체 > 클래스
    클래스는 구조체 +함수(메서드)로 이루어져 있다
    3. 사용자 정의 타입
    사용자가 원하는 타입을 생성할 수 있다.
    클래스를 사용한다면 코드가 덜복잡해지고 유지보수에 용의하다

    1] 인스턴스 변수 = iv (instance variable) {인스턴스(객체 = iv의 묶음)가 생성되었을 때}
    2] 지역 변수  = lv   (local variable) {변수 선언문이 수행되었을 때}
    3] 클래스 변수 = cv  (class variable) {클래스(설계도가 필요할 때)가 메모리에 올라갈 때 / 객체 생성 필요없음}

    * 디스크에서 파일을 램으로 올리는 행위 - 로딩
    * 파일을 수정 후 디스크에 다시 저장하는 것 - 세이브
    * CPU는 RAM하고만 일한다.

    [1] 클래스 영역 = cv, iv
    [2] 메소드 영역 = lv
    * */
}